Revit 2026 API

# CompoundStructureSetExtendableRegionIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetExtendableRegionIds(
	bool top,
	IList<int> regionIds
)
```
```vb
Public Sub SetExtendableRegionIds (
	top As Boolean,
	regionIds As IList(Of Integer)
)
```
```cpp
public:
void SetExtendableRegionIds(
	bool top,
	IList<int>^ regionIds
)
```
```fsharp
member SetExtendableRegionIds :
        top : bool *
        regionIds : IList<int> -> unit
```

#### Parameters

top Boolean

regionIds IListInt32

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace